export default {
  projections: {
    ЗаказыE: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колПерсон: {
        __caption__: 'Количество персон'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      номера: {
        __caption__: 'Номера',
        номерКомнаты: {
          __caption__: 'Номер комнаты'
        }
      },
      клиенты: {
        __caption__: 'Клиенты',
        фамилия: {
          __caption__: 'Фамилия клиента'
        }
      },
      сотрудник: {
        __caption__: 'Сотрудник ',
        фамилия: {
          __caption__: 'Фамилия сотрудника'
        }
      },
      заказБлюд: {
        __caption__: 'Заказ блюд',
        комментарий: {
          __caption__: 'Комментарий'
        },
        блюда: {
          __caption__: 'Блюда',
          наименование: {
            __caption__: 'Наименование'
          },
          стоимость: {
            __caption__: 'Стоимость блюда'
          }
        }
      },
      заказНапитков: {
        __caption__: 'Заказ напитков',
        комментарий: {
          __caption__: 'Комментарий'
        },
        напитки: {
          __caption__: 'Напитки',
          наименование: {
            __caption__: 'Наименование'
          },
          стоимость: {
            __caption__: 'Стоимость напитка'
          }
        }
      }
    },
    ЗаказыL: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колПерсон: {
        __caption__: 'Количество персон'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      номера: {
        __caption__: 'Номер комнаты',
        номерКомнаты: {
          __caption__: 'Номер комнаты'
        }
      },
      клиенты: {
        __caption__: 'Фамилия клиента',
        фамилия: {
          __caption__: 'Фамилия клиента'
        }
      },
      сотрудник: {
        __caption__: 'Фамилия сотрудника',
        фамилия: {
          __caption__: 'Фамилия сотрудника'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    кодЗаказа: {
      __caption__: 'Код заказа'
    },
    колПерсон: {
      __caption__: 'Количество персон'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    типВручения: {
      __caption__: 'Тип вручения'
    },
    типОплаты: {
      __caption__: 'Тип оплаты'
    },
    клиенты: {
      __caption__: 'Клиенты'
    },
    номера: {
      __caption__: 'Номера'
    },
    сотрудник: {
      __caption__: 'Сотрудник '
    },
    заказБлюд: {
      __caption__: 'Заказ блюд'
    },
    заказНапитков: {
      __caption__: 'Заказ напитков'
    }
  }
};
